{
  "backend/main.mo": "Main canister logic handling access control, user profiles, video uploads, premium subscriptions, and blob storage via mixins.",
  "backend/migration_types.mo": "Defines old/new actor state types for migrations, adding optional customization settings to existing stored data.",
  "feature_evidence.json": "Feature evidence report mapping video-related frontend changes to features, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing routing, components, hooks, and styling.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables, theming rules, and dark mode tokens.",
  "frontend/index.html": "Root HTML file injecting the React app entrypoint via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app in theme and toast providers.",
  "frontend/src/components/AppHeader.tsx": "Header with app branding, navigation buttons, and authentication-dependent profile or login controls.",
  "frontend/src/components/AppLayout.tsx": "Main layout including header, routed content, profile setup dialog, and footer.",
  "frontend/src/components/AuthGuard.tsx": "Authorization utility and component prompting sign-in before protected actions.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity login/logout button handling authentication state and query cache resets.",
  "frontend/src/components/PostCard.tsx": "Displays a post card with author info, media preview, tags, and actions including like, repost, share, and download.",
  "frontend/src/components/PostVideo.tsx": "Loads and displays a video by ID with loading and error states using useVideoFile.",
  "frontend/src/components/ProfileMenu.tsx": "Provides a dropdown menu for the current user with profile info, premium/admin links, and logout.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to set up a username and full name.",
  "frontend/src/components/VideoUploadField.tsx": "Handles video file selection with validation, preview, and removal for uploads.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks for checking admin status and performing admin login/logout with toast feedback.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches and exposes the caller's user profile and authentication state.",
  "frontend/src/hooks/useCustomizationSettings.ts": "Retrieves and saves user customization settings through backend actor calls with toast notifications.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and identity loading.",
  "frontend/src/hooks/usePremiumSubscription.ts": "Implements hooks to query premium status and perform premium upgrade or cancellation via actor methods with toast feedback.",
  "frontend/src/hooks/useQueries.ts": "Contains various mutation hooks for saving profiles, liking/reposting templates, uploading videos, and publishing in‑memory template posts.",
  "frontend/src/hooks/useTemplatePosts.ts": "Provides a query hook to fetch combined mock and newly created template posts, plus a helper to add new posts to memory.",
  "frontend/src/hooks/useVideoFile.ts": "Fetches a video file by ID from the backend actor using a React Query hook.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom CSS variables for themes, and utility classes including glass effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Renders an admin interface handling II login, admin authentication, and customization settings management.",
  "frontend/src/pages/ComposePage.tsx": "Implements a form for creating new template posts, including optional video upload and publishing logic.",
  "frontend/src/pages/FeedPage.tsx": "Renders the main feed with trending/latest tabs, optimistic like/repost updates, and skeleton loading states.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a single post with mock data, video or image preview, and like/repost/share/download actions.",
  "frontend/src/pages/PremiumPage.tsx": "Shows premium subscription status, features, and upgrade/cancel actions with authentication checks.",
  "frontend/src/types/post.ts": "Defines the TemplatePost interface describing post metadata, media, and engagement fields.",
  "frontend/src/utils/directDownload.ts": "Attempts to open a template link; if blocked, copies it to the clipboard with toast notifications.",
  "frontend/src/utils/shareToAlightMotion.ts": "Opens a deep link for Alight Motion or falls back to copying it to the clipboard with feedback.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting hash and query modes.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, plugins, and content paths.",
  "project_state.json": "JSON describing project metadata, existing features, and design/auth notes for an Alight Motion template sharing app. It tracks schema version, project state, feature list, and UI/architecture guidance."
}