{
  "backend/main.mo": "Main actor implementing access control, user profiles, premium subscriptions, template posts, and likes with associated authorization checks.",
  "backend/migration_types.mo": "Defines OldActor and NewActor state types, adding optional customization settings in the new version.",
  "backend/migration.mo": "Migration script that sets the new appCustomizationSettings field to null when upgrading actor state.",
  "feature_evidence.json": "Lists feature evidence records mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind CSS base configuration defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Base HTML document loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the app’s router with routes for feed, post, compose, premium, and admin pages under a themed layout.",
  "frontend/src/components/AppHeader.tsx": "Header with branding, navigation buttons, and authentication/profile controls.",
  "frontend/src/components/AppLayout.tsx": "Root layout wrapping pages with header, outlet, profile setup dialog, and footer.",
  "frontend/src/components/AuthGuard.tsx": "Provides a hook and component to enforce authentication before performing protected actions.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/PostCard.tsx": "Renders a card view for a template post with author info, preview, tags, and actions for liking, reposting, and sharing.",
  "frontend/src/components/ProfileMenu.tsx": "Dropdown menu showing the current user’s profile with premium/admin options and logout handling.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new authenticated users to set a username and full name, submitting via a profile save mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refetches dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Hooks for checking admin status and performing admin login/logout using the actor with toast notifications.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the caller’s user profile and exposes authentication state and principal info.",
  "frontend/src/hooks/useCustomizationSettings.ts": "Hooks to load and save user customization settings via the actor, with query invalidation and toast feedback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and utilities for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/usePremiumSubscription.ts": "Hooks for getting premium status and upgrading or canceling premium subscriptions with query updates and toasts.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query mutation hooks for saving user profiles, liking posts, and reposting templates with toast notifications.",
  "frontend/src/index.css": "Configures Tailwind base styles and CSS variables for light/dark themes and global utility classes.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin panel with authentication, admin login, and customization settings management.",
  "frontend/src/pages/ComposePage.tsx": "Provides a form for creating new template posts with validation, mock submission, and navigation.",
  "frontend/src/pages/FeedPage.tsx": "Renders a mock feed of template posts with like and repost interactions and tab navigation.",
  "frontend/src/pages/PostDetailPage.tsx": "Displays a detailed view of a single template post with author info and like/repost actions using mock data.",
  "frontend/src/pages/PremiumPage.tsx": "UI page showing Premium plan details, authentication gate, feature list, and upgrade/cancel actions using subscription hooks.",
  "frontend/src/types/post.ts": "Defines the TemplatePost interface with metadata, engagement stats, and optional tags and preview image.",
  "frontend/src/utils/shareToAlightMotion.ts": "Attempts to open a deep link for Alight Motion and falls back to copying the template link with toast notifications.",
  "frontend/src/utils/urlParams.ts": "Utility for reading URL parameters, persisting them in sessionStorage, and managing hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state metadata describing features, requirements, notes, and versioning for the Alight Motion template app."
}