{
  "kind": "build_request",
  "title": "Add video (with sound) upload option for posts",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Extend the post data model to support an optional uploaded video (with audio) attachment, so a post can include either an image preview URL and/or a playable video.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a video option for uploading"
        ]
      },
      "acceptanceCriteria": [
        "Backend types include an optional video reference for a post (e.g., video asset id and basic metadata like content type).",
        "Frontend `TemplatePost` type is updated to represent the optional video attachment in a backward-compatible way (existing non-video posts still render)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Implement backend APIs to accept a video upload from an authenticated user and to serve the uploaded video back to clients by id.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a video option for uploading"
        ]
      },
      "acceptanceCriteria": [
        "There is a shared (update) backend method that allows an authenticated user to upload a video file payload and returns a stable identifier for later retrieval.",
        "There is a query backend method that returns the stored video bytes (or a chunk) and its content type when given a valid video id.",
        "Unauthorized callers are rejected using the existing authorization approach (user role required).",
        "The backend enforces a clear maximum upload size and returns a user-safe error on oversize uploads."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Update the Compose page to include a \"Video\" upload option that lets a signed-in user select a video file (with audio), preview it before posting, and publish the post with the uploaded video attached.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a video option for uploading"
        ]
      },
      "acceptanceCriteria": [
        "`/compose` includes a video file input option labeled in English (e.g., \"Video file\") alongside the existing fields.",
        "When a user selects a video, the UI shows an in-form preview using an HTML5 `<video>` player with controls enabled (audio not forcibly muted).",
        "Submitting the form uploads the video first (showing a loading state), then includes the returned video id/reference when creating the post.",
        "If the user is not signed in, the existing sign-in gating behavior is preserved and user-facing messages are in English."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Render video attachments in the feed post card and post detail page so users can play videos with sound when a post includes a video attachment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a video option for uploading"
        ]
      },
      "acceptanceCriteria": [
        "If a post has a video attachment, the PostCard renders a video preview/player (or a clear play affordance) instead of the static placeholder image.",
        "The PostDetail page renders an HTML5 `<video>` player with controls enabled for video posts.",
        "Non-video posts continue to render exactly as before (image URL if present, otherwise the existing placeholder)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add/extend React Query hooks and mutations to support creating posts that include an uploaded video reference, and ensure the feed refreshes after publishing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a video option for uploading"
        ]
      },
      "acceptanceCriteria": [
        "There are React Query mutations for (1) uploading a video and (2) creating/publishing the post with the returned video reference.",
        "On successful publish, the user sees an English success toast and is navigated back to the feed, and the feed query is invalidated/refetched to include the new post.",
        "On failure (upload or publish), the user sees an English error toast with a helpful message and the UI returns to a usable state (no stuck loading)."
      ]
    },
    {
      "id": "REQ-27",
      "text": "If adding new persisted backend state for videos changes the actor's stable state shape, add a conditional migration so existing deployments upgrade without losing data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a video option for uploading"
        ]
      },
      "acceptanceCriteria": [
        "If stable state is used for post/video storage, `backend/migration_types.mo` is updated to include the new fields in `NewActor`.",
        "A `backend/migration.mo` is added/updated only if required by the project’s migration policy, and existing state fields are preserved during upgrade."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`.",
    "Do not edit any paths listed in `frontend.immutablePaths` (compose existing UI components instead).",
    "Use English for all user-facing text (labels, buttons, toasts, errors)."
  ],
  "nonGoals": [
    "Integrating third-party video hosting/CDNs or external storage services.",
    "Implementing real-time upload progress via sockets/WebSockets.",
    "Advanced video transcoding, streaming manifests (HLS/DASH), or adaptive bitrate playback."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}