{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-09T16:12:34.567Z",
  "summary": "Video upload UI components and frontend types were added, plus backend methods/types for storing video metadata using ExternalBlob. However, several BuildRequest requirements are not fully met: the post data model is not actually extended/used end-to-end, backend serving returns metadata rather than bytes/chunks, backend auth and max-size enforcement are missing, React Query publish flow appears to be mock/in-memory rather than backend-backed with confirmed invalidation/toasts, and no stable-state migration changes are shown.",
  "missing_requirements": [
    {
      "id": "REQ-22",
      "requirement": "Extend the post data model to support an optional uploaded video attachment on posts (backend + frontend) so existing non-video posts still render.",
      "reason": "Frontend TemplatePost was extended with optional video fields, but the backend post data model is not shown being extended (no post type/storage changes are evidenced). The implementation also appears to rely on mock/in-memory posts rather than a backend post model.",
      "evidence": [
        "frontend/src/types/post.ts",
        "frontend/src/hooks/useQueries.ts",
        "frontend/src/hooks/useTemplatePosts.ts",
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-23",
      "requirement": "Backend APIs to accept a video upload from an authenticated user and serve the uploaded video bytes (or chunk) and content type by video id; enforce max upload size with user-safe error; reject unauthorized callers using existing auth approach.",
      "reason": "Upload exists and checks user permission, but there is no maximum upload size enforcement in the backend, and the query method getVideoFile does not enforce authorization. Additionally, getVideoFile returns a VideoFile record with an ExternalBlob rather than explicitly returning bytes/chunks + content type as required.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-26",
      "requirement": "Add/extend React Query hooks/mutations for (1) uploading a video and (2) publishing a post with the returned video reference; on success show English success toast, navigate back to feed, and invalidate/refetch feed; on failure show English error toast and recover UI.",
      "reason": "An upload mutation exists and shows English error toasts. The publish mutation appears to create a mock post locally (comment says backend has no post storage yet) rather than calling a backend API. The onSuccess portion is truncated, so feed invalidation/refetch and success toast cannot be confirmed from the diff summary.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts",
        "frontend/src/hooks/useTemplatePosts.ts",
        "frontend/src/pages/ComposePage.tsx"
      ]
    },
    {
      "id": "REQ-27",
      "requirement": "If new persisted backend state for videos changes stable state shape, add conditional migration so upgrades preserve existing data (update backend/migration_types.mo and migration.mo if required).",
      "reason": "Diff shows new in-memory videoFiles map and counter in backend/main.mo, but no evidence of stable state shape updates or any migration files being added/modified.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Frontend feed/post system continues to use mock data and in-memory createdPosts/addTemplatePost rather than backend post storage/APIs.",
      "reason": "BuildRequest is about adding video upload/attachment support to posts; the diff introduces/retains a demo/mock post storage approach (explicitly noted in code comments) which is not requested as part of the feature requirements.",
      "evidence": [
        "frontend/src/hooks/useTemplatePosts.ts",
        "frontend/src/hooks/useQueries.ts"
      ]
    },
    {
      "description": "Backend VideoFile includes an extra templateId field (set to 0) not described in requirements.",
      "reason": "Requirements ask for an optional video reference and basic metadata (e.g., content type). Introducing templateId on the stored video record is additional behavior/data not requested in the BuildRequest.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.74,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/PostCard.tsx",
    "frontend/src/components/PostVideo.tsx",
    "frontend/src/components/VideoUploadField.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/hooks/useTemplatePosts.ts",
    "frontend/src/hooks/useVideoFile.ts",
    "frontend/src/pages/ComposePage.tsx",
    "frontend/src/pages/FeedPage.tsx",
    "frontend/src/pages/PostDetailPage.tsx",
    "frontend/src/types/post.ts",
    "project_state.json"
  ]
}